#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.prod_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.stg_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-prod/front-autoscaler]
module.prod_apps.kubernetes_service.front: Refreshing state... [id=greenmile-prod/front]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-stg/front-autoscaler]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler: Refreshing state... [id=default/auth-autoscaler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler" "front_autoscaler" {
        id = "greenmile-prod/front-autoscaler"


      ~ spec {
            # (3 unchanged attributes hidden)

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }


            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.prod_apps.kubernetes_ingress_v1.app_ingress will be created
  + resource "kubernetes_ingress_v1" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class" = "gce"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path      = "/*"
                      + path_type = "ImplementationSpecific"

                      + backend {

                          + service {
                              + name = "front"

                              + port {
                                  + name = "http"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler must be replaced
-/+ resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      ~ id = "default/auth-autoscaler" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "auth-autoscaler"
          ~ namespace        = "default" -> "greenmile-stg" # forces replacement
          ~ resource_version = "1172033" -> (known after apply)
          ~ uid              = "f57933dc-1f78-47fc-b7ca-6325a07b1be3" -> (known after apply)
        }

      ~ spec {
          ~ target_cpu_utilization_percentage = 0 -> (known after apply)
            # (2 unchanged attributes hidden)

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }

          ~ metric {
                # (1 unchanged attribute hidden)

              ~ resource {
                    name = "cpu"

                  ~ target {
                        # (2 unchanged attributes hidden)
                    }
                }
            }

          ~ scale_target_ref {
                name = "auth-microservice"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler" "front_autoscaler" {
        id = "greenmile-stg/front-autoscaler"


      ~ spec {
            # (3 unchanged attributes hidden)

          - behavior {
              - scale_down {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }

              - scale_up {
                  - select_policy                = "Max" -> null
                  - stabilization_window_seconds = 0 -> null

                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Pods" -> null
                      - value          = 4 -> null
                    }
                  - policy {
                      - period_seconds = 15 -> null
                      - type           = "Percent" -> null
                      - value          = 100 -> null
                    }
                }
            }


            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.kubernetes_ingress_v1.app_ingress will be created
  + resource "kubernetes_ingress_v1" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class" = "gce"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "stg"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path      = "/*"
                      + path_type = "ImplementationSpecific"

                      + backend {

                          + service {
                              + name = "front"

                              + port {
                                  + name = "http"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.stg_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "stg"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

Plan: 6 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @au2001, Action: `pull_request`*